Revit 2026 API

# HardwoodTintEnabledType Enumeration

---

The enumerated type representing the permitted values for the asset property "HardwoodTintEnabled" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HardwoodTintEnabledType
```
```vb
Public Enumeration HardwoodTintEnabledType
```
```cpp
public enum class HardwoodTintEnabledType
```
```fsharp
type HardwoodTintEnabledType
```

| Member name | Value | Description |
| --- | --- | --- |
| ColorChoice | 1 |  |
| NoColor | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace